In [1]:
import sqlite3

In [ ]:
# Connecting to the SQLIte3 Database

In [2]:
con = sqlite3.connect('Employees.db')

In [ ]:
#putting the connector into a container or variable

In [3]:
cursor = con.cursor()

In [ ]:
# Creating a table called HR

In [ ]:
cursor.execute("CREATE TABLE HR(id integer PRIMARY KEY, name text, status text, salary real, department text, position text, hiredDate)")

con.commit()

In [ ]:
con.commit()

In [ ]:
cursor.execute("INSERT INTO HR VALUES (1, 'Kate', 'Yes', 700,'Tech','Manager',2021-07-11 )")
con.commit()

In [11]:
counter=True 
while counter:


    user_id = int(input('Enter your ID number: '))
    name = input('Enter your name: ')
    status = input('What is your status ?: ')
    salary = float(input('Enter your salary: '))
    department = input('Enter your department: ')
    position = input('What is your postion?: ')
    hireDate = input('Enter Date YYYY-M-D: ')
    entities = (user_id,name,status,salary,department,position,hireDate)
    cursor.execute("INSERT INTO HR(id,name,status,salary,department,position,hiredDate)VALUES (?,?,?,?,?,?,?)",entities)
    con.commit()
    print('Your Data has been recorded sucessfully!')
    value= int(input('Do you want to to continue? Enter 1 to continue , Enter 0 to Quit\n'))
    if value == 1:
        pass
    elif value == 0:
        print('Thank You!')
        counter= False
    else:
        break

Enter your ID number: 6
Enter your name: Mary Aina
What is your status ?: Yes
Enter your salary: 90000000
Enter your department: Technical
What is your postion?: Senior Data Scientist
Enter Date YYYY-M-D: 2021-01-07
Your Data has been recorded sucessfully!
Do you want to to continue? Enter 1 to continue , Enter 0 to Quit
0
Thank You!

In [ ]:
# querying data from the data base

In [12]:
cursor.execute("SELECT * FROM HR")

rows=cursor.fetchall()

In [13]:
for row in rows:
    print(row)

(1, 'Kate', 'Yes', 700.0, 'Tech', 'Manager', 2003)
(2, 'Maria', 'Yes', 6000.0, 'tech', 'Trainer', '2021-08-09')
(3, 'Fanny A', 'No', 3000.0, 'Product design', 'Admin', '2021-09-08')
(4, 'Chinenye Vivian', 'Yes', 7000.0, 'Technical', 'Data Sceintist', '2021-07-07')
(5, 'Emeto Winner', 'Yes', 90000.0, 'Technical', 'facilitator', '2021-01-03')
(6, 'Mary Aina', 'Yes', 90000000.0, 'Technical', 'Senior Data Scientist', '2021-01-07')

### DATA TRANSFORMATION

In [14]:
mydict={}

In [15]:
 for row in rows:
    print(row)
    print(rows[0])

(1, 'Kate', 'Yes', 700.0, 'Tech', 'Manager', 2003)
(1, 'Kate', 'Yes', 700.0, 'Tech', 'Manager', 2003)
(2, 'Maria', 'Yes', 6000.0, 'tech', 'Trainer', '2021-08-09')
(1, 'Kate', 'Yes', 700.0, 'Tech', 'Manager', 2003)
(3, 'Fanny A', 'No', 3000.0, 'Product design', 'Admin', '2021-09-08')
(1, 'Kate', 'Yes', 700.0, 'Tech', 'Manager', 2003)
(4, 'Chinenye Vivian', 'Yes', 7000.0, 'Technical', 'Data Sceintist', '2021-07-07')
(1, 'Kate', 'Yes', 700.0, 'Tech', 'Manager', 2003)
(5, 'Emeto Winner', 'Yes', 90000.0, 'Technical', 'facilitator', '2021-01-03')
(1, 'Kate', 'Yes', 700.0, 'Tech', 'Manager', 2003)
(6, 'Mary Aina', 'Yes', 90000000.0, 'Technical', 'Senior Data Scientist', '2021-01-07')
(1, 'Kate', 'Yes', 700.0, 'Tech', 'Manager', 2003)

In [16]:
mylist=[]

In [17]:
for row in rows:
    mylist.append({'id':row[0],'name':row[1],'status':row[2],'salary':row[3],'department':row[4],'position':row[5],'hiredDate':row[6]})

In [18]:
print(mylist)

[{'id': 1, 'name': 'Kate', 'status': 'Yes', 'salary': 700.0, 'department': 'Tech', 'position': 'Manager', 'hiredDate': 2003}, {'id': 2, 'name': 'Maria', 'status': 'Yes', 'salary': 6000.0, 'department': 'tech', 'position': 'Trainer', 'hiredDate': '2021-08-09'}, {'id': 3, 'name': 'Fanny A', 'status': 'No', 'salary': 3000.0, 'department': 'Product design', 'position': 'Admin', 'hiredDate': '2021-09-08'}, {'id': 4, 'name': 'Chinenye Vivian', 'status': 'Yes', 'salary': 7000.0, 'department': 'Technical', 'position': 'Data Sceintist', 'hiredDate': '2021-07-07'}, {'id': 5, 'name': 'Emeto Winner', 'status': 'Yes', 'salary': 90000.0, 'department': 'Technical', 'position': 'facilitator', 'hiredDate': '2021-01-03'}, {'id': 6, 'name': 'Mary Aina', 'status': 'Yes', 'salary': 90000000.0, 'department': 'Technical', 'position': 'Senior Data Scientist', 'hiredDate': '2021-01-07'}]

In [19]:
import pandas as pd

In [20]:
df= pd.DataFrame(mylist)
df

,id,name,status,salary,department,position,hiredDate
0,1,Kate,Yes,700.0,Tech,Manager,2003
1,2,Maria,Yes,6000.0,tech,Trainer,2021-08-09
2,3,Fanny A,No,3000.0,Product design,Admin,2021-09-08
3,4,Chinenye Vivian,Yes,7000.0,Technical,Data Sceintist,2021-07-07
4,5,Emeto Winner,Yes,90000.0,Technical,facilitator,2021-01-03
5,6,Mary Aina,Yes,90000000.0,Technical,Senior Data Scientist,2021-01-07

In [ ]:
(id,name,status,salary,department,position,hiredDate